src/DataProcessors/МодульОбменаЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МодульОбменаЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/ТранспортныеМодулиЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТранспортныеМодулиЕГАИС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФСРАР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОрганизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеГрузоотправителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияУТМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпонятьОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьДвоичныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеТТН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийТранспортныйМодуль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалениеСообщенийВУТМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособУдаленияСообщенийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КлассификаторОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КлассификаторОрганизацийЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТС</Name>
					<Comment>Номер таможенного союза</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтоматическоеПеремещениеВТЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/МодульОбменаЕГАИС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Организация   = ПараметрыСеанса.Организация;
	Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
	Автор         = ПараметрыСеанса.ТекущийПользователь;
	
	//Если ПравоПользователя("РазрешатьКорректировкуОстатковВТорговомЗалеВРазрезеСправок2") = Истина Тогда
		Элементы.ОткрытьКорректировкуОстатковВТорговомЗале.Видимость = Истина;
	//Иначе
	//	Элементы.ОткрытьКорректировкуОстатковВТорговомЗале.Видимость = Ложь;
	//КонецЕсли;
	
	//ВосстановитьНастройкиМодуляОбмена();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбработатьОтветыЕГАИС(Команда)
	
	МассивТранспортныхМодулей = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТранспортныеМодули Цикл
		Если ТекущаяСтрока.Пометка Тогда
			МассивТранспортныхМодулей.Добавить(ТекущаяСтрока.ТранспортныйМодуль);
		КонецЕсли;
	КонецЦикла;
	
	ИнтеграцияЕГАИСКлиент.ВыполнитьОбмен(МассивТранспортныхМодулей, , УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортныеМодули(Команда)
	
	ОткрытьФорму("Справочник.ТранспортныеМодулиЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлкогольнуюПродукцию(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыАлкогольнойПродукции(Команда)
	
	ОткрытьФорму("Справочник.ВидыАлкогольнойПродукции.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОрганизацииЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторОрганизацийЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВходящиеТТН(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсходящиеТТН(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.СообщенияЕГАИСПрисоединенныеФайлы.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправки1(Команда)
	
	ОткрытьФорму("Справочник.Справки1ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправки2(Команда)
	
	ОткрытьФорму("Справочник.Справки2ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктыПостановкиНаБаланс(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКорректировкуОстатковВТорговомЗале(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.КорректировкаОстатковВТорговомЗалеВРазрезеСправок2ЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнвентаризациюАлкогольнойПродукцииЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктыПривязкиМарокЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПривязкиМарокЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктыСписания(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиМарокЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиМарокЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекиЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетыОбИмпортеПродукцииЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеремещениеВТорговыйЗалЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПеремещениеВТорговыйЗалЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыМарокЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросМарокЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроверкиОстатковМарокВЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПроверкаОстатковМарокВЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормированиеГрупповойТары(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ФормированиеГрупповойТарыЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетыЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДобавлениеОрганизацииЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ДобавлениеОрганизацииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДобавлениеАлкоподукцииЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ДобавлениеАлкоподукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортныеНакладные(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Процедура СохранитьНастройкиМодуляОбмена()
//	
//	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиФормыМодуляОбмена", "ТранспортныеМодули", ТранспортныеМодули);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ВосстановитьНастройкиМодуляОбмена()
//	
//	ТранспортныеМодули = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиФормыМодуляОбмена", "ТранспортныеМодули", ТранспортныеМодули);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаДокументов(ИмяФормы,
	                                   ДальнейшееДействиеЕГАИС = Неопределено,
	                                   ОткрытьРаспоряжения = Ложь,
	                                   ИмяПоляАвтор = Неопределено,
	                                   ИмяПоляОрганизация = Неопределено)
	
	////СтруктураБыстрогоОтбора = Новый Структура();
	ПараметрыФормы = Новый Структура;
	
	//Если ОткрытьРаспоряжения Тогда
	//	ПараметрыФормы.Вставить("ОткрытьРаспоряжения", Истина);
	//ИначеЕсли ДальнейшееДействиеЕГАИС <> Неопределено Тогда
	//	СтруктураБыстрогоОтбора.Вставить("ДальнейшееДействиеЕГАИС", ДальнейшееДействиеЕГАИС);
	//КонецЕсли;
	//
	//Если ИмяПоляАвтор = Неопределено Тогда
	//	ИмяПоляАвтор = "Автор";
	//КонецЕсли;
	//
	//Если ИмяПоляОрганизация = Неопределено Тогда
	//	ИмяПоляОрганизация = "ОрганизацияЕГАИС";
	//КонецЕсли;
	
	//СтруктураБыстрогоОтбора.Вставить(ИмяПоляАвтор, Автор);
	//СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизация,   ОрганизацииЕГАИС);
	//
	//ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы,,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура АвторПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресУТМ(ТранспортныйМодуль)
	
	РеквизитыАдреса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТранспортныйМодуль, "АдресСервера, ПортСервера");
	Результат = "http://" + РеквизитыАдреса.АдресСервера + ":" + Формат(РеквизитыАдреса.ПортСервера, "ЧГ=0") + "/";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТранспортныеМодулиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТранспортныеМодули.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТранспортныеМодулиИзменить" Тогда
		ПоказатьЗначение(, ТекущиеДанные.ТранспортныйМодуль);
		Возврат;
	КонецЕсли;
	
	Если НЕ Поле.Имя = "ТранспортныеМодулиАдресУТМ" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ТранспортныйМодуль) Тогда
		Возврат;
	КонецЕсли;
	
	АдресУТМ = ПолучитьАдресУТМ(ТекущиеДанные.ТранспортныйМодуль);
	
	ОбщегоНазначенияКлиент.ОткрытьНавигационнуюСсылку(АдресУТМ, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеМодулиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТранспортныеМодули.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ТранспортныйМодуль) Тогда
		ТекущиеДанные.Изменить = "Настроить";
	Иначе
		ТекущиеДанные.Изменить = "УТМ не выбран";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ТранспортныйМодуль) Тогда
		ТекущиеДанные.АдресУТМ = "Открыть";
	Иначе
		ТекущиеДанные.АдресУТМ = "УТМ не выбран";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеМодулиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если (Не НоваяСтрока) ИЛИ ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТранспортныеМодули.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ТранспортныйМодуль) Тогда
		ТекущиеДанные.Изменить = "Настроить";
	Иначе
		ТекущиеДанные.Изменить = "УТМ не выбран";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ТранспортныйМодуль) Тогда
		ТекущиеДанные.АдресУТМ = "Открыть";
	Иначе
		ТекущиеДанные.АдресУТМ = "УТМ не выбран";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыУстановитьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из ТранспортныеМодули Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыСнятьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из ТранспортныеМодули Цикл
		ТекущаяСтрока.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОстаткиАкцизныхМарокЕГАИС(Команда)
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	//ОтчетОтбор.Вставить("Номенклатура", ПолучитьСписокТоваров(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ОстаткиИОборотыАкцизныхМарокЕГАИС.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Ложь), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетНеобработанныеТТНЕГАИС(Команда)
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	//ОтчетОтбор.Вставить("Номенклатура", ПолучитьСписокТоваров(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.НеобработанныеТТНЕГАИС.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Ложь), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДвиженияМеждуРегистрамиЕГАИС(Команда)
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	//ОтчетОтбор.Вставить("Номенклатура", ПолучитьСписокТоваров(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ДвиженияМеждуРегистрамиЕГАИС.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Ложь), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДвиженияПоСправке2ЕГАИС(Команда)
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	//ОтчетОтбор.Вставить("Номенклатура", ПолучитьСписокТоваров(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ДвиженияМеждуРегистрамиЕГАИС.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Ложь), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоискМарокЕГАИС(Команда)
	
	ОткрытьФорму("Обработка.МодульОбменаЕГАИС.Форма.ФормаПоискМарокЕГАИС", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлкогольнаяДекларация(Команда)
	
	ОткрытьФорму("Обработка.ДекларацияОбОборотеАлкоголя.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОстаткиАлкогольнойПродукцииЕГАИС(Команда)
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	//ОтчетОтбор.Вставить("Номенклатура", ПолучитьСписокТоваров(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ОстаткиИОборотыАлкогольнойПродукцииЕГАИС.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Ложь), ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТранспортнымиМодулямиНаСервере(ВсеТранспортныеМодули = Истина)
	
	ТранспортныеМодули.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТранспортныеМодулиЕГАИС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТранспортныеМодулиЕГАИС КАК ТранспортныеМодулиЕГАИС
	|"+?(НЕ ВсеТранспортныеМодули, "ГДЕ
	|	ТранспортныеМодулиЕГАИС.РабочееМесто = &РабочееМесто ИЛИ 
	|	ТранспортныеМодулиЕГАИС.ОбщийТранспортныйМодуль = Истина","")+"";
	
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ТранспортныеМодулиСправочник = Выборка.Выбрать();
	Пока ТранспортныеМодулиСправочник.Следующий() Цикл
		НоваяСтрока = ТранспортныеМодули.Добавить();
		НоваяСтрока.ТранспортныйМодуль = ТранспортныеМодулиСправочник.Ссылка;
		НоваяСтрока.Изменить = "Настроить";
		НоваяСтрока.АдресУТМ = "Открыть";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспортнымиМодулями(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещение,"Перед заполнением необходима очистка таблицы транспортные модули, продолжить операцию?",
	РежимДиалогаВопрос.ДаНетОтмена,0, КодВозвратаДиалога.Да);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Оповещение = Новый ОписаниеОповещения("ПередНачаломЗаполненияТранспортыхМодулей", ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Заполнить таблицу транспортными модулями для всех рабочих мест?",
		РежимДиалогаВопрос.ДаНетОтмена,0, КодВозвратаДиалога.Да);
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломЗаполненияТранспортыхМодулей(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТранспортнымиМодулямиНаСервере(Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьТранспортнымиМодулямиНаСервере(Ложь);
	КонецЕсли;	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти
